{
  "TABLE_ID": "table_0_db_2",
  "TABLE_NAME": "livros",
  "COLUMNS": {
    "livro_id": {
      "FIELD_ID": "field_0_table_0_db_2",
      "FIELD_NAME": "livro_id",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "titulo": {
      "FIELD_ID": "field_1_table_0_db_2",
      "FIELD_NAME": "titulo",
      "TYPE": "object",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "autor": {
      "FIELD_ID": "field_2_table_0_db_2",
      "FIELD_NAME": "autor",
      "TYPE": "object",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "edicao": {
      "FIELD_ID": "field_3_table_0_db_2",
      "FIELD_NAME": "edicao",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "ano": {
      "FIELD_ID": "field_4_table_0_db_2",
      "FIELD_NAME": "ano",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "editora": {
      "FIELD_ID": "field_5_table_0_db_2",
      "FIELD_NAME": "editora",
      "TYPE": "object",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "genero_id": {
      "FIELD_ID": "field_6_table_0_db_2",
      "FIELD_NAME": "genero_id",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "descricao": {
      "FIELD_ID": "field_7_table_0_db_2",
      "FIELD_NAME": "descricao",
      "TYPE": "object",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "preco": {
      "FIELD_ID": "field_8_table_0_db_2",
      "FIELD_NAME": "preco",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "estoque": {
      "FIELD_ID": "field_9_table_0_db_2",
      "FIELD_NAME": "estoque",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    },
    "reserva": {
      "FIELD_ID": "field_10_table_0_db_2",
      "FIELD_NAME": "reserva",
      "TYPE": "int64",
      "CONSTRAINTS": "livros-from-csv",
      "KEY TYPE": "",
      "ORIGIN TABLE": "",
      "FOREIGIN CONSTRAINTS": ""
    }
  },
  "DATA": [
    {
      "livro_id": 1,
      "titulo": "Artificial Intelligence: A Modern Approach",
      "autor": "Stuart Russell, Peter Norvig",
      "edicao": 4,
      "ano": 2020,
      "editora": "Pearson",
      "genero_id": 1,
      "descricao": "The long-anticipated revision of this #1 selling book offers the most comprehensive, state of the art introduction to the theory and practice of artificial intelligence for modern applications.Intelligent Agents. Solving Problems by Searching. Informed Search Methods. Game Playing. Agents that Reason Logically. First-order Logic. Building a Knowledge Base. Inference in First-Order Logic. Logical Reasoning Systems",
      "preco": 600,
      "estoque": 5,
      "reserva": 0
    },
    {
      "livro_id": 2,
      "titulo": "Deep Learning Illustrated: A Visual, Interactive Guide to Artificial Intelligence",
      "autor": "Jon Krohn , Grant Beyleveld , Aglaé Bassens",
      "edicao": 1,
      "ano": 2019,
      "editora": "Addison-Wesley Professional",
      "genero_id": 2,
      "descricao": "Deep learning is transforming software, facilitating powerful new artificial intelligence capabilities, and driving unprecedented algorithm performance. Deep Learning Illustrated is uniquely intuitive and offers a complete introduction to the discipline's techniques.",
      "preco": 278,
      "estoque": 13,
      "reserva": 0
    },
    {
      "livro_id": 3,
      "titulo": "Atlas of AI: Power, Politics, and the Planetary Costs of Artificial Intelligence",
      "autor": "Kate Crawford",
      "edicao": 1,
      "ano": 2021,
      "editora": "Yale University Press",
      "genero_id": 1,
      "descricao": "What happens when artificial intelligence saturates political life and depletes the planet? How is AI shaping our understanding of ourselves and our societies? Drawing on more than a decade of research, award-winning scholar Kate Crawford reveals how AI is a technology of extraction",
      "preco": 162,
      "estoque": 22,
      "reserva": 0
    },
    {
      "livro_id": 4,
      "titulo": "Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems",
      "autor": "Aurélien Géron",
      "edicao": 2,
      "ano": 2019,
      "editora": "O'Reilly Media",
      "genero_id": 2,
      "descricao": "Through a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This practical book shows you how.",
      "preco": 341,
      "estoque": 12,
      "reserva": 0
    },
    {
      "livro_id": 5,
      "titulo": "Introduction to Machine Learning",
      "autor": "Ethem Alpaydin",
      "edicao": 4,
      "ano": 2020,
      "editora": "MIT Press",
      "genero_id": 2,
      "descricao": "This substantially revised fourth edition of a comprehensive, widely used machine learning textbook offers new coverage of recent advances in the field in both theory and practice, including developments in deep learning and neural networks.",
      "preco": 598,
      "estoque": 9,
      "reserva": 0
    },
    {
      "livro_id": 6,
      "titulo": "Inteligência Artificial - Uma Abordagem de Aprendizado de Máquina",
      "autor": "Katti Faceli, Ana Carolina Lorena, João Gama, Tiago Agostinho de Almeida, André C P L F de Carvalho",
      "edicao": 2,
      "ano": 2021,
      "editora": "LTC Editora",
      "genero_id": 2,
      "descricao": "Inteligência Artificial sob novos olhares. Com abordagem equilibrada de tópicos básicos e avançados desenvolvidos por renomados pesquisadores da área, esta nova edição traz exemplos de implemen­tações dos métodos abordados e exercícios teóricos e práticos.",
      "preco": 143,
      "estoque": 23,
      "reserva": 0
    },
    {
      "livro_id": 7,
      "titulo": "Cybernetics: Second Edition: Or the Control and Communication in the Animal and the Machine",
      "autor": "Norbert Wiener",
      "edicao": 2,
      "ano": 2013,
      "editora": "Martino Fine Books",
      "genero_id": 7,
      "descricao": "Cybernetics was defined in the mid 20th century by Norbert Wiener as the scientific study of control and communication in the animal and the machine.",
      "preco": 186,
      "estoque": 24,
      "reserva": 0
    },
    {
      "livro_id": 8,
      "titulo": "The Human Use of Human Beings: Cybernetics and Society",
      "autor": "Norbert Wiener",
      "edicao": 1,
      "ano": 1988,
      "editora": "Da Capo",
      "genero_id": 7,
      "descricao": "Founder of the science of cybernetics--the study of the relationship between computers and the human nervous system--Wiener was widely misunderstood as one who advocated the automation of human life. As this book reveals, his vision was much more complex and interesting.",
      "preco": 64,
      "estoque": 28,
      "reserva": 0
    },
    {
      "livro_id": 9,
      "titulo": "Database System Concepts",
      "autor": "Abraham Silberschatz, Henry Korth, S. Sudarshan",
      "edicao": 7,
      "ano": 2019,
      "editora": "McGraw-Hill Education",
      "genero_id": 6,
      "descricao": "Database System Concepts by Silberschatz, Korth and Sudarshan is now in its 7th edition and is one of the cornerstone texts of database education. It presents the fundamental concepts of database management in an intuitive manner geared toward allowing students to begin working with databases as quickly as possible.",
      "preco": 748,
      "estoque": 19,
      "reserva": 0
    },
    {
      "livro_id": 10,
      "titulo": "Fundamentals of Database Systems",
      "autor": "Ramez Elmasri, Shamkant Navathe",
      "edicao": 7,
      "ano": 2012,
      "editora": "Pearson",
      "genero_id": 6,
      "descricao": "Clear explanations of theory and design, broad coverage of models and real systems, and an up-to-date introduction to modern database technologies result in a leading introduction to database systems. Intended for computer science majors, Fundamentals of Database Systems, 6/e emphasizes math models, design issues, relational algebra, and relational calculus.",
      "preco": 537,
      "estoque": 26,
      "reserva": 0
    },
    {
      "livro_id": 11,
      "titulo": "Database Systems: The Complete Book",
      "autor": "Hector Garcia-Molina, Jeffrey D. Ullman, Jennifer Widom",
      "edicao": 2,
      "ano": 2008,
      "editora": "Pearson Prentice Hall",
      "genero_id": 6,
      "descricao": "Written by well-known computer scientists, this introduction to database systems offers a comprehensive approach, focusing on database design, database use, and implementation of database applications and database management systems.",
      "preco": 611,
      "estoque": 31,
      "reserva": 0
    },
    {
      "livro_id": 12,
      "titulo": "C Programming Language (ANSI)",
      "autor": "Brian W. Kernighan, Dennis Ritchie",
      "edicao": 1,
      "ano": 1988,
      "editora": "Prentice Hall",
      "genero_id": 5,
      "descricao": "The authors present the complete guide to ANSI standard C language programming. Written by the developers of C, this new version helps readers keep up with the finalized ANSI standard for C while showing how to take advantage of C's rich set of operators, economy of expression, improved control flow, and data structures.",
      "preco": 380,
      "estoque": 28,
      "reserva": 0
    },
    {
      "livro_id": 13,
      "titulo": "Core Java, Volume I: Fundamentals",
      "autor": "Cay Horstmann",
      "edicao": 5,
      "ano": 2021,
      "editora": "Oracle Press",
      "genero_id": 5,
      "descricao": "This book is written for readers with prior programming experience who are looking for in-depth coverage of the Java language and platform. You'll learn about all language features in detail, including the recent improvements in Java 17. The applied chapters and code examples cover the most up-to-date capabilities of the vast Java library.",
      "preco": 322,
      "estoque": 21,
      "reserva": 0
    },
    {
      "livro_id": 14,
      "titulo": "Java How to Program, Early Objects",
      "autor": "Paul Deitel , Harvey Deitel",
      "edicao": 1,
      "ano": 2017,
      "editora": "Pearson",
      "genero_id": 5,
      "descricao": "The Deitels’ groundbreaking How to Program series offers unparalleled breadth and depth of programming fundamentals, object-oriented programming concepts and intermediate-level topics for further study. Java How to Program, Early Objects, 11th Edition, presents leading-edge computing technologies using the Deitel signature live-code approach",
      "preco": 470,
      "estoque": 12,
      "reserva": 0
    },
    {
      "livro_id": 15,
      "titulo": "Intro to Python for Computer Science and Data Science: Learning to Program with Ai, Big Data and the Cloud",
      "autor": "Paul Deitel , Harvey Deitel",
      "edicao": 1,
      "ano": 2019,
      "editora": "Pearson",
      "genero_id": 5,
      "descricao": "Providing the most current coverage of topics and applications, the book is paired with extensive traditional supplements as well as Jupyter Notebooks supplements. Real-world datasets and artificial-intelligence technologies allow students to work on projects making a difference in business, industry, government and academia",
      "preco": 564,
      "estoque": 18,
      "reserva": 0
    },
    {
      "livro_id": 16,
      "titulo": "The Master Algorithm: How the Quest for the Ultimate Learning Machine Will Remake Our World",
      "autor": "Pedro Domingos",
      "edicao": 1,
      "ano": 2018,
      "editora": "Basic Books",
      "genero_id": 1,
      "descricao": "A thought-provoking and wide-ranging exploration of machine learning and the race to build computer intelligences as flexible as our own In the world's top research labs and universities, the race is on to invent the ultimate learning algorithm: one capable of discovering any knowledge from data, and doing anything we want, before we even ask.",
      "preco": 85,
      "estoque": 14,
      "reserva": 0
    },
    {
      "livro_id": 17,
      "titulo": "Neuromancer",
      "autor": "William Gibson",
      "edicao": 1,
      "ano": 2014,
      "editora": "Editora Aleph",
      "genero_id": 4,
      "descricao": "Considerada a obra precursora do movimento cyberpunk e um clássico da ficção científica moderna, Neuromancer conta a história de Case, um cowboy do ciberespaço e hacker da matrix.",
      "preco": 33,
      "estoque": 25,
      "reserva": 0
    },
    {
      "livro_id": 18,
      "titulo": "Design Patterns: Elements of Reusable Object-Oriented Software",
      "autor": "Erich Gamma , Richard Helm , Ralph Johnson Dr , John Vlissides",
      "edicao": 1,
      "ano": 1994,
      "editora": "Addison-Wesley Professional",
      "genero_id": 5,
      "descricao": "Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves.",
      "preco": 359,
      "estoque": 38,
      "reserva": 0
    },
    {
      "livro_id": 19,
      "titulo": "A Máquina Diferencial",
      "autor": "William Gibson , Bruce Sterling",
      "edicao": 1,
      "ano": 2012,
      "editora": "Aleph",
      "genero_id": 4,
      "descricao": "Uma visionária fantasia heavy metal movida a vapor! Gibson e Sterling criam uma grandiosa realidade virtual vitoriana, extraordinária em riquezas e detalhes. Ridley Scott, diretor de Alien , Blade runner e Gladiado",
      "preco": 50,
      "estoque": 20,
      "reserva": 0
    },
    {
      "livro_id": 20,
      "titulo": "Periféricos",
      "autor": "William Gibson",
      "edicao": 1,
      "ano": 2020,
      "editora": "Aleph",
      "genero_id": 4,
      "descricao": "Retomando o ambiente futurista e tecnológico de Neuromancer, Periféricos se revela um thriller policial surpreendente, agudo e original, e deixa claro porque William Gibson é um dos mais talentosos e proféticos escritores de nosso tempo.",
      "preco": 38,
      "estoque": 11,
      "reserva": 0
    },
    {
      "livro_id": 21,
      "titulo": "Cryptonomicon",
      "autor": "Neal Stephenson",
      "edicao": 1,
      "ano": 2009,
      "editora": "William Morrow",
      "genero_id": 4,
      "descricao": "A breathtaking tour de force, and Neal Stephenson's most accomplished and affecting work to date, Cryptonomicon is profound and prophetic, hypnotic and hyper-driven, as it leaps forward and back between World War II and the World Wide Web, hinting all the while at a dark day-after-tomorrow.",
      "preco": 89,
      "estoque": 29,
      "reserva": 0
    },
    {
      "livro_id": 22,
      "titulo": "Memórias Póstumas De Brás Cubas - Edição especial",
      "autor": "Machado De Assis , Candido Portinari (Ilustrador)",
      "edicao": 1,
      "ano": 2019,
      "editora": "Antofagica Editora",
      "genero_id": 3,
      "descricao": "Brás Cubas está morto. Mas isso não o impede de relatar em seu livro os acontecimentos de sua existência e de sua grande ideia fixa: lançar o Emplasto Brás Cubas. Deus te livre, leitor, de uma ideia fixa. O medicamento anti-hipocondríaco torna-se o estopim de uma série de lembranças, reminiscências e digressões da vida do defunto autor.",
      "preco": 90,
      "estoque": 24,
      "reserva": 0
    }
  ],
  "KEY_DATA": {},
  "PRIMARY_KEY": [],
  "FOREIGN_KEY": [],
  "UNIQUE_KEY": []
}